backend/app/controllers/resources_controller.rb

  def index
    render json: Resource.all
---
SELECT "resources".* FROM "resources"